Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20G17A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2017 Atmel Corporation,                                        -->
<!--                    a wholly owned subsidiary of Microchip Technology Inc.    -->
<!-- Licensed under the Apache License, Version 2.0 (the "License");              -->
<!-- you may not use this file except in compliance with the License.             -->
<!-- You may obtain a copy of the Licence at                                      -->
<!--                                                                              -->
<!--     http://www.apache.org/licenses/LICENSE-2.0                               -->
<!--                                                                              -->
<!-- Unless required by applicable law or agreed to in writing, software          -->
<!-- distributed under the License is distributed on an "AS IS" BASIS,            -->
<!-- WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.     -->
<!-- See the License for the specific language governing permissions and          -->
<!-- limitations under the License.                                               -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="SAMC20G17A-MN" package="QFN48" pinout="SAMC21G" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC20G17A-AN" package="TQFP48" pinout="SAMC21G" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATSAMC20G17A" architecture="CORTEX-M0PLUS" family="SAMC" series="SAMC20">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX0" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="R"/>
          <memory-segment name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="31"/>
        <param name="__CM0PLUS_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.1.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42005000"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="AIN" index="2" function="B_AC" pad="PA06"/>
              <signal group="AIN" index="3" function="B_AC" pad="PA07"/>
              <signal group="AIN" index="4" function="B_AC" pad="PA02"/>
              <signal group="AIN" index="5" function="B_AC" pad="PA03"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
              <signal group="CMP" index="2" function="H" pad="PA00"/>
              <signal group="CMP" index="2" function="H" pad="PA24"/>
              <signal group="CMP" index="3" function="H" pad="PA01"/>
              <signal group="CMP" index="3" function="H" pad="PA25"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7"/>
              <param name="GCLK_ID" value="40"/>
              <param name="NUM_CMP" value="4"/>
              <param name="PAIRS" value="1"/>
              <param name="SPEED_LEVELS" value="2"/>
              <param name="INSTANCE_ID" value="84"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="2.2.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x42004400"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC1" pad="PA02"/>
              <signal group="AIN" index="0" function="B_ADC0" pad="PA02"/>
              <signal group="AIN" index="1" function="B_ADC1" pad="PA03"/>
              <signal group="AIN" index="1" function="B_ADC0" pad="PA03"/>
              <signal group="AIN" index="2" function="B_ADC1" pad="PB08"/>
              <signal group="AIN" index="2" function="B_ADC0" pad="PB08"/>
              <signal group="AIN" index="3" function="B_ADC1" pad="PB09"/>
              <signal group="AIN" index="3" function="B_ADC0" pad="PB09"/>
              <signal group="AIN" index="4" function="B_ADC1" pad="PA04"/>
              <signal group="AIN" index="4" function="B_ADC0" pad="PA04"/>
              <signal group="AIN" index="5" function="B_ADC1" pad="PA05"/>
              <signal group="AIN" index="5" function="B_ADC0" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC1" pad="PA06"/>
              <signal group="AIN" index="6" function="B_ADC0" pad="PA06"/>
              <signal group="AIN" index="7" function="B_ADC1" pad="PA07"/>
              <signal group="AIN" index="7" function="B_ADC0" pad="PA07"/>
              <signal group="AIN" index="8" function="B_ADC0" pad="PA08"/>
              <signal group="AIN" index="9" function="B_ADC0" pad="PA09"/>
              <signal group="AIN" index="10" function="B_ADC1" pad="PB02"/>
              <signal group="AIN" index="10" function="B_ADC0" pad="PA10"/>
              <signal group="AIN" index="11" function="B_ADC1" pad="PB03"/>
              <signal group="AIN" index="11" function="B_ADC0" pad="PA11"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="42"/>
              <param name="EXTCHANNEL_MSB" value="11"/>
              <param name="GCLK_ID" value="33"/>
              <param name="INT_CH30" value="0"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="INSTANCE_ID" value="81"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.0.1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42005C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PB10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="1" function="I" pad="PB11"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="38"/>
              <param name="IO_NUM" value="12"/>
              <param name="LUT_NUM" value="4"/>
              <param name="SEQ_NUM" value="2"/>
              <param name="INSTANCE_ID" value="87"/>
            </parameters>
          </instance>
        </module>
        <module name="DIVAS" id="U2258" version="1.0.0">
          <instance name="DIVAS">
            <register-group name="DIVAS" name-in-module="DIVAS" address-space="base" offset="0x48000000"/>
