Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20G17A.atdf
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="16" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="HMATRIXB_MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__ARBT">
        <value name="ROUND_ROBIN" caption="Round-Robin Arbitration" value="0"/>
        <value name="FIXED_PRIORITY" caption="Fixed Priority Arbitration" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB0">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB1">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB2">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB3">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB4">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB5">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB6">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB7">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB8">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB9">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB10">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB11">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB12">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB13">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB14">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_MRCR__RCB15">
        <value name="DIS" caption="Disable remapped address decoding for master" value="0"/>
        <value name="ENA" caption="Enable remapped address decoding for master" value="1"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2234" version="2.0.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
